app/controllers/accounts_controller.rb

  def create
    @account = current_user.accounts.build(params[:account])
    if @account.save
---
INSERT INTO "accounts" ("created_at", "updated_at", "eve_api_key", "eve_user_id", "user_id") VALUES('2009-06-23 22:16:57', '2009-06-23 22:16:57', '86367590638745A19D2CBA2A252A686EEE7B98D6CBF14FF2AA4345A8FEC21B1F', '5131295', 1)

  def edit
    @account = current_user.accounts.find(params[:id])
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1 AND ("accounts".user_id = 1))

  def destroy
    @account = current_user.accounts.find(params[:id])
    @account.destroy
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 3 AND ("accounts".user_id = 1))
DELETE FROM "accounts" WHERE "id" = 3

  def show
    @account = current_user.accounts.find(params[:id])
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1 AND ("accounts".user_id = 1))